---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LogicalOrFilter
source: html/09b974a7-2675-7aea-0402-b63b8a6b2e69.htm
---
# LogicalOrFilter Members

Constructs a new instance of the logical filter with any number of input filters.